
{
  "font-family": "Specifies the font family for text.",
  "font-size": "Specifies the size of the font.",
  "font-weight": "Specifies the weight of a font.",
  "color": "Sets the color of text.",
  "background-color": "Sets the background color of an element.",
  "display": "Specifies how an element is displayed on the page.",
  "position": "Specifies the positioning method for an element.",
  "float": "Specifies how an element should float.",
  "width": "Sets the width of an element.",
  "margin": "Sets the margin area on all four sides of an element.",
  "padding": "Sets the padding area on all four sides of an element.",
  "border": "A shorthand property for border-width, border-style and border-color.",
  "border-radius": "Defines the radius of the element's corners.",
  "background-image": "Sets one or more background images for an element.",
  "clear": "Specifies which sides of an element where other floating elements are not allowed.",
  "z-index": "Specifies the stack order of an element.",
  "top": "Specifies the top position of a positioned element.",
  "right": "Specifies the right position of a positioned element.",
  "bottom": "Specifies the bottom position of a positioned element.",
  "left": "Specifies the left position of a positioned element.",
  "height": "Sets the height of an element.",
  "min-width": "Sets the minimum width of an element.",
  "max-width": "Sets the maximum width of an element.",
  "min-height": "Sets the minimum height of an element.",
  "max-height": "Sets the maximum height of an element.",
  "margin-top": "Sets the top margin of an element.",
  "margin-right": "Sets the right margin of an element.",
  "margin-bottom": "Sets the bottom margin of an element.",
  "margin-left": "Sets the left margin of an element.",
  "padding-top": "Sets the top padding of an element.",
  "padding-right": "Sets the right padding of an element.",
  "padding-bottom": "Sets the bottom padding of an element.",
  "padding-left": "Sets the left padding of an element.",
  "box-sizing": "Defines how the width and height of an element are calculated.",
  "font-style": "Specifies the font style for text.",
  "font-variant": "Specifies whether or not a text should be displayed in a small-caps font.",
  "line-height": "Sets the line height.",
  "text-align": "Specifies the horizontal alignment of text in an element.",
  "text-transform": "Controls the capitalization of text.",
  "text-decoration": "Specifies the decoration added to text.",
  "letter-spacing": "Increases or decreases the space between characters in a text.",
  "word-spacing": "Increases or decreases the white space between words.",
  "background": "A shorthand property for setting all background properties in one declaration.",
  "background-repeat": "Sets how a background image will be repeated.",
  "background-position": "Sets the starting position of a background image.",
  "background-size": "Specifies the size of the background images.",
  "background-attachment": "Sets whether a background image scrolls with the rest of the page, or is fixed.",
  "border-width": "Sets the width of an element's four borders.",
  "border-style": "Sets the style of an element's four borders.",
  "border-color": "Sets the color of an element's four borders.",
  "display-flex": "Specifies the type of box used for an HTML element with flex layout.",
  "flex-direction": "Specifies the direction of the flexible items inside a flex container.",
  "flex-wrap": "Specifies whether the flexible items should wrap or not.",
  "flex-flow": "A shorthand property for flex-direction and flex-wrap.",
  "justify-content": "Aligns the flexible container's items when the items do not use all available space on the main-axis.",
  "align-items": "Aligns the flexible container's items when the items do not use all available space on the cross-axis.",
  "align-content": "Aligns a flex container's lines within the flex container when there is extra space on the cross-axis.",
  "flex": "A shorthand property for the flex-grow, flex-shrink, and the flex-basis properties.",
  "flex-grow": "Specifies how much a flex item will grow relative to the rest of the flex items.",
  "flex-shrink": "Specifies how much a flex item will shrink relative to the rest of the flex items.",
  "flex-basis": "Specifies the initial length of a flex item.",
  "align-self": "Specifies the alignment for a specific flex item inside a flex container.",
  "order": "Specifies the order of a flex item relative to the rest of the flex items inside the same container.",
  "display-grid": "Specifies the type of box used for an HTML element with grid layout.",
  "grid-template-columns": "Specifies the size of the columns, and how many columns in a grid layout.",
  "grid-template-rows": "Specifies the size of the rows, and how many rows in a grid layout.",
  "grid-template-areas": "Specifies how to display columns and rows, using named grid items.",
  "grid-template": "A shorthand property for the grid-template-rows, grid-template-columns and grid-template-areas properties.",
  "grid-column-gap": "Specifies the gap between the columns in a grid layout.",
  "grid-row-gap": "Specifies the gap between the rows in a grid layout.",
  "transition": "A shorthand property for setting the four transition properties into a single property.",
  "transition-property": "Specifies the name of the CSS property the transition effect is for.",
  "transition-duration": "Specifies how many seconds or milliseconds a transition effect takes to complete.",
  "transition-timing-function": "Specifies the speed curve of the transition effect.",
  "animation": "A shorthand property for all the animation properties.",
  "animation-name": "Specifies a name for the @keyframes animation.",
  "animation-duration": "Specifies how many seconds or milliseconds an animation takes to complete one cycle.",
  "keyframes": "Specifies the animation code for a CSS animation."
}
