
{
  "font-family": "Specifies the font family for text.",
  "font-size": "Specifies the size of the font.",
  "font-weight": {
    "normal": "Default value. Normal font weight.",
    "bold": "Bold font weight.",
    "bolder": "Bolder font weight than the parent element.",
    "lighter": "Lighter font weight than the parent element.",
    "100": "Sets a specific font weight - equivalent to 'thin'.",
    "200": "Sets a specific font weight - equivalent to 'extra-light'.",
    "300": "Sets a specific font weight - equivalent to 'light'.",
    "400": "Sets a specific font weight - equivalent to 'normal'.",
    "500": "Sets a specific font weight - equivalent to 'medium'.",
    "600": "Sets a specific font weight - equivalent to 'semi-bold'.",
    "700": "Sets a specific font weight - equivalent to 'bold'.",
    "800": "Sets a specific font weight - equivalent to 'extra-bold'.",
    "900": "Sets a specific font weight - equivalent to 'black'.",
    "inherit": "Inherits the font weight from the parent element.",
    "initial": "Sets the default value."
  },
  "color": "Sets the color of text.",
  "background-color": "Sets the background color of an element.",
  "display": {
    "inline": "Displays an element as an inline element (like <span>).",
    "block": "Displays an element as a block element (like <p>).",
    "contents": "Makes the container disappear, making the child elements children of the parent.",
    "flex": "Displays an element as a block-level flex container.",
    "grid": "Displays an element as a block-level grid container.",
    "inline-block": "Displays an element as an inline-level block container.",
    "inline-flex": "Displays an element as an inline-level flex container.",
    "inline-grid": "Displays an element as an inline-level grid container.",
    "inline-table": "The element is displayed as an inline-level table.",
    "list-item": "Let the element behave like a <li> element.",
    "run-in": "Displays an element as either block or inline, depending on context.",
    "table": "Let the element behave like a <table> element.",
    "table-caption": "Let the element behave like a <caption> element.",
    "table-column-group": "Let the element behave like a <colgroup> element.",
    "table-header-group": "Let the element behave like a <thead> element.",
    "table-footer-group": "Let the element behave like a <tfoot> element.",
    "table-row-group": "Let the element behave like a <tbody> element.",
    "table-cell": "Let the element behave like a <td> element.",
    "table-column": "Let the element behave like a <col> element.",
    "table-row": "Let the element behave like a <tr> element.",
    "none": "The element is not displayed and does not take up space on the page.",
    "initial": "Sets this property to its default value.",
    "inherit": "Inherits this property from its parent element."
  },
  "position": {
    "static": "Default value. Elements render in order, as they appear in the document flow.",
    "relative": "The element is positioned relative to its normal position.",
    "absolute": "The element is positioned relative to its first positioned (not static) ancestor element.",
    "fixed": "The element is positioned relative to the browser window and doesn't move during scrolling.",
    "sticky": "The element is positioned based on the user's scroll position (hybrid of relative and fixed).",
    "initial": "Sets this property to its default value.",
    "inherit": "Inherits this property from its parent element."
  },
  "float": "Specifies how an element should float.",
  "width": "Sets the width of an element.",
  "margin": "Sets the margin area on all four sides of an element.",
  "padding": "Sets the padding area on all four sides of an element.",
  "border": "A shorthand property for border-width, border-style and border-color.",
  "border-radius": "Defines the radius of the element's corners.",
  "background-image": "Sets one or more background images for an element.",
  "clear": "Specifies which sides of an element where other floating elements are not allowed.",
  "z-index": "Specifies the stack order of an element.",
  "top": "Specifies the top position of a positioned element.",
  "right": "Specifies the right position of a positioned element.",
  "bottom": "Specifies the bottom position of a positioned element.",
  "left": "Specifies the left position of a positioned element.",
  "height": "Sets the height of an element.",
  "min-width": "Sets the minimum width of an element.",
  "max-width": "Sets the maximum width of an element.",
  "min-height": "Sets the minimum height of an element.",
  "max-height": "Sets the maximum height of an element.",
  "margin-top": "Sets the top margin of an element.",
  "margin-right": "Sets the right margin of an element.",
  "margin-bottom": "Sets the bottom margin of an element.",
  "margin-left": "Sets the left margin of an element.",
  "padding-top": "Sets the top padding of an element.",
  "padding-right": "Sets the right padding of an element.",
  "padding-bottom": "Sets the bottom padding of an element.",
  "padding-left": "Sets the left padding of an element.",
  "box-sizing": "Defines how the width and height of an element are calculated.",
  "font-style": "Specifies the font style for text.",
  "font-variant": "Specifies whether or not a text should be displayed in a small-caps font.",
  "line-height": "Sets the line height.",
  "text-align": "Specifies the horizontal alignment of text in an element.",
  "text-transform": "Controls the capitalization of text.",
  "text-decoration": "Specifies the decoration added to text.",
  "letter-spacing": "Increases or decreases the space between characters in a text.",
  "word-spacing": "Increases or decreases the white space between words.",
  "background": "A shorthand property for setting all background properties in one declaration.",
  "background-repeat": "Sets how a background image will be repeated.",
  "background-position": "Sets the starting position of a background image.",
  "background-size": "Specifies the size of the background images.",
  "background-attachment": "Sets whether a background image scrolls with the rest of the page, or is fixed.",
  "border-width": "Sets the width of an element's four borders.",
  "border-style": "Sets the style of an element's four borders.",
  "border-color": "Sets the color of an element's four borders.",
  "display-flex": "Specifies the type of box used for an HTML element with flex layout.",
  "flex-direction": {
    "row": "Default value. The flexible items are displayed horizontally, as a row.",
    "row-reverse": "Same as row, but in reverse order.",
    "column": "The flexible items are displayed vertically, as a column.",
    "column-reverse": "Same as column, but in reverse order.",
    "initial": "Sets this property to its default value.",
    "inherit": "Inherits this property from its parent element."
  },
  "flex-wrap": "Specifies whether the flexible items should wrap or not.",
  "flex-flow": "A shorthand property for flex-direction and flex-wrap.",
  "justify-content": {
    "center": "Items are centered along the flex container's main axis.",
    "flex-start": "Default value. Items are positioned at the beginning of the container.",
    "flex-end": "Items are positioned at the end of the container.",
    "space-between": "Items are evenly distributed in the line; first item is on the start line, last item on the end line.",
    "space-around": "Items are evenly distributed with equal space around them.",
    "space-evenly": "Items are distributed so that the spacing between any two adjacent items is equal.",
    "inherit": "Inherits this property from its parent element.",
    "initial": "Sets this property to its default value."
  },
  "align-items": {
    "stretch": "Default value. Items are stretched to fit the container.",
    "center": "Items are positioned at the center of the container.",
    "flex-start": "Items are positioned at the beginning of the container.",
    "flex-end": "Items are positioned at the end of the container.",
    "baseline": "Items are positioned at the baseline of the container.",
    "initial": "Sets this property to its default value.",
    "inherit": "Inherits this property from its parent element."
  },
  "align-content": "Aligns a flex container's lines within the flex container when there is extra space on the cross-axis.",
  "flex": "A shorthand property for the flex-grow, flex-shrink, and the flex-basis properties.",
  "flex-grow": "Specifies how much a flex item will grow relative to the rest of the flex items.",
  "flex-shrink": "Specifies how much a flex item will shrink relative to the rest of the flex items.",
  "flex-basis": "Specifies the initial length of a flex item.",
  "align-self": "Specifies the alignment for a specific flex item inside a flex container.",
  "order": "Specifies the order of a flex item relative to the rest of the flex items inside the same container.",
  "display-grid": "Specifies the type of box used for an HTML element with grid layout.",
  "grid-template-columns": "Specifies the size of the columns, and how many columns in a grid layout.",
  "grid-template-rows": "Specifies the size of the rows, and how many rows in a grid layout.",
  "grid-template-areas": "Specifies how to display columns and rows, using named grid items.",
  "grid-template": "A shorthand property for the grid-template-rows, grid-template-columns and grid-template-areas properties.",
  "grid-column-gap": "Specifies the gap between the columns in a grid layout.",
  "grid-row-gap": "Specifies the gap between the rows in a grid layout.",
  "transition": "A shorthand property for setting the four transition properties into a single property.",
  "transition-property": "Specifies the name of the CSS property the transition effect is for.",
  "transition-duration": "Specifies how many seconds or milliseconds a transition effect takes to complete.",
  "transition-timing-function": "Specifies the speed curve of the transition effect.",
  "animation": "A shorthand property for all the animation properties.",
  "animation-name": "Specifies a name for the @keyframes animation.",
  "animation-duration": "Specifies how many seconds or milliseconds an animation takes to complete one cycle.",
  "keyframes": "Specifies the animation code for a CSS animation.",
  "@font-face": "A rule that allows websites to download and use fonts other than the \"web-safe\" fonts.",
  "@keyframes": "Specifies the animation code.",
  "animation-delay": "Specifies when the animation will start.",
  "animation-direction": "Specifies whether the animation should play in reverse on alternate cycles.",
  "animation-fill-mode": "Specifies what values are applied by the animation outside the time it is executing.",
  "animation-iteration-count": "Specifies the number of times an animation should be played.",
  "animation-play-state": "Specifies whether the animation is running or paused.",
  "background-blend-mode": "Specifies the blending mode of each background layer (color/image).",
  "background-clip": "Specifies how far the background (color or image) should extend within an element.",
  "background-origin": "Specifies the origin position of a background image.",
  "border-bottom": "A shorthand property for border-bottom-width, border-bottom-style and border-bottom-color.",
  "border-bottom-color": "Sets the color of the bottom border.",
  "border-bottom-left-radius": "Defines the radius of the border of the bottom-left corner.",
  "border-bottom-right-radius": "Defines the radius of the border of the bottom-right corner.",
  "border-bottom-style": "Sets the style of the bottom border.",
  "border-bottom-width": "Sets the width of the bottom border.",
  "border-collapse": "Sets whether table borders should collapse into a single border or be separated.",
  "border-image": "A shorthand property for all the border-image-* properties.",
  "border-image-outset": "Specifies the amount by which the border image area extends beyond the border box.",
  "border-image-repeat": "Specifies whether the border image should be repeated, rounded or stretched.",
  "border-image-slice": "Specifies how to slice the border image.",
  "border-image-source": "Specifies the path to the image to be used as a border.",
  "border-image-width": "Specifies the width of the border image.",
  "border-left": "A shorthand property for all the border-left-* properties.",
  "border-left-color": "Sets the color of the left border.",
  "border-left-style": "Sets the style of the left border.",
  "border-left-width": "Sets the width of the left border.",
  "border-right": "A shorthand property for all the border-right-* properties.",
  "border-right-color": "Sets the color of the right border.",
  "border-right-style": "Sets the style of the right border.",
  "border-right-width": "Sets the width of the right border.",
  "border-spacing": "Sets the distance between the borders of adjacent cells.",
  "border-top": "A shorthand property for border-top-width, border-top-style and border-top-color.",
  "border-top-color": "Sets the color of the top border.",
  "border-top-left-radius": "Defines the radius of the border of the top-left corner.",
  "border-top-right-radius": "Defines the radius of the border of the top-right corner.",
  "border-top-style": "Sets the style of the top border.",
  "border-top-width": "Sets the width of the top border.",
  "box-shadow": "Attaches one or more shadows to an element.",
  "caption-side": "Specifies the placement of a table caption.",
  "clip": "Clips an absolutely positioned element.",
  "column-count": "Specifies the number of columns an element should be divided into.",
  "column-fill": "Specifies how to fill columns, balanced or not.",
  "column-gap": "Specifies the gap between the columns.",
  "column-rule": "A shorthand property for all the column-rule-* properties.",
  "column-rule-color": "Specifies the color of the rule between columns.",
  "column-rule-style": "Specifies the style of the rule between columns.",
  "column-rule-width": "Specifies the width of the rule between columns.",
  "column-span": "Specifies how many columns an element should span across.",
  "column-width": "Specifies the column width.",
  "columns": "A shorthand property for column-width and column-count.",
  "content": "Used with the :before and :after pseudo-elements, to insert generated content.",
  "counter-increment": "Increases or decreases the value of one or more CSS counters.",
  "counter-reset": "Creates or resets one or more CSS counters.",
  "cursor": "Specifies the mouse cursor to be displayed when pointing over an element.",
  "direction": "Specifies the text direction/writing direction.",
  "empty-cells": "Specifies whether or not to display borders and background on empty cells in a table.",
  "filter": "Defines effects (e.g. blurring or color shifting) on an element before the element is displayed.",
  "font": "A shorthand property for the font-style, font-variant, font-weight, font-size/line-height, and the font-family properties.",
  "font-size-adjust": "Preserves the readability of text when font fallback occurs.",
  "font-stretch": "Selects a normal, condensed, or expanded face from a font family.",
  "hanging-punctuation": "Specifies whether a punctuation character may be placed outside the line box.",
  "hyphens": "Sets how to split words to improve the layout of paragraphs.",
  "list-style": "A shorthand property for all the list-style-* properties.",
  "list-style-image": "Specifies an image as the list-item marker.",
  "list-style-position": "Specifies the position of the list-item markers (bullet points).",
  "list-style-type": "Specifies the type of list-item marker.",
  "opacity": "Sets the opacity level for an element.",
  "orphans": "Sets the minimum number of lines that must be left at the bottom of a page when a page break occurs inside an element.",
  "outline": "A shorthand property for the outline-width, outline-style, and the outline-color properties.",
  "outline-color": "Sets the color of an outline.",
  "outline-offset": "Offsets an outline, and draws it beyond the border edge.",
  "outline-style": "Sets the style of an outline.",
  "outline-width": "Sets the width of an outline.",
  "overflow": "Specifies what happens if content overflows an element's box.",
  "overflow-wrap": "Specifies whether or not the browser may break lines within words in order to prevent overflow.",
  "overflow-x": "Specifies whether to clip the content, add a scroll bar, or display overflow content of a block-level element, when it overflows at the left and right edges.",
  "overflow-y": "Specifies whether to clip the content, add a scroll bar, or display overflow content of a block-level element, when it overflows at the top and bottom edges.",
  "page-break-after": "Sets the page-breaking behavior after an element.",
  "page-break-before": "Sets the page-breaking behavior before an element.",
  "page-break-inside": "Sets the page-breaking behavior inside an element.",
  "perspective": "Gives a 3D-positioned element some perspective.",
  "perspective-origin": "Defines at which position the user is looking at the 3D-positioned element.",
  "quotes": "Sets the type of quotation marks for embedded quotations.",
  "resize": "Defines if (and how) an element is resizable by the user.",
  "tab-size": "Specifies the width of a tab character.",
  "table-layout": "Defines the algorithm used to lay out table cells, rows, and columns.",
  "text-align-last": "Specifies how the last line of a block or a line right before a forced line break is aligned when text-align is 'justify'.",
  "text-decoration-color": "Specifies the color of the text-decoration.",
  "text-decoration-line": "Specifies the type of line in a text-decoration.",
  "text-decoration-style": "Specifies the style of the line in a text decoration.",
  "text-indent": "Specifies the indentation of the first line in a text-block.",
  "text-justify": "Specifies the justification method used when text-align is 'justify'.",
  "text-overflow": "Specifies what should happen when text overflows the containing element.",
  "text-shadow": "Adds shadow to text.",
  "transform": "Applies a 2D or 3D transformation to an element.",
  "transform-origin": "Allows you to change the position on transformed elements.",
  "transform-style": "Specifies how nested elements are rendered in 3D space.",
  "transition-delay": "Specifies when the transition effect will start.",
  "unicode-bidi": "Used together with the direction property to set or return whether the text should be overridden to support multiple languages in the same document.",
  "vertical-align": "Sets the vertical alignment of an element.",
  "visibility": "Specifies whether or not an element is visible.",
  "white-space": "Specifies how white-space inside an element is handled.",
  "widows": "Sets the minimum number of lines that must be left at the top of a page when a page break occurs inside an element.",
  "word-break": "Specifies how words should break when reaching the end of a line.",
  "word-wrap": "Allows long words to be able to be broken and wrap onto the next line."
}
